Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D28.svd
            <register>
               <name>PPCFG5</name>
               <description>Post Processing Configuration Register 5</description>
               <addressOffset>0x00000580</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CSCVR</name>
                     <description>Color Space Conversion R coefficient for Chrominance R component, signed format. (step 1/1024)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSCVG</name>
                     <description>Color Space Conversion G coefficient for Chrominance R component, signed format. (step 1/512)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSCVB</name>
                     <description>Color Space Conversion B coefficient for Chrominance R component, signed format. (step 1/1024)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSCVOFF</name>
                     <description>Color Space Conversion Chrominance R Offset</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>256</dim>
               <dimIncrement>4</dimIncrement>
               <name>BASECLUT[%s]</name>
               <description>Base CLUT Register</description>
               <addressOffset>0x00000600</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BCLUT</name>
                     <description>Blue Color Entry</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GCLUT</name>
                     <description>Green Color Entry</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RCLUT</name>
                     <description>Red Color Entry</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>256</dim>
               <dimIncrement>4</dimIncrement>
               <name>OVR1CLUT[%s]</name>
               <description>Overlay 1 CLUT Register</description>
               <addressOffset>0x00000A00</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BCLUT</name>
                     <description>Blue Color Entry</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GCLUT</name>
                     <description>Green Color Entry</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RCLUT</name>
                     <description>Red Color Entry</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ACLUT</name>
                     <description>Alpha Color Entry</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>256</dim>
               <dimIncrement>4</dimIncrement>
               <name>OVR2CLUT[%s]</name>
               <description>Overlay 2 CLUT Register</description>
               <addressOffset>0x00000E00</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BCLUT</name>
                     <description>Blue Color Entry</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GCLUT</name>
                     <description>Green Color Entry</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RCLUT</name>
                     <description>Red Color Entry</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ACLUT</name>
                     <description>Alpha Color Entry</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>256</dim>
               <dimIncrement>4</dimIncrement>
               <name>HEOCLUT[%s]</name>
               <description>High-End Overlay CLUT Register</description>
               <addressOffset>0x00001200</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BCLUT</name>
                     <description>Blue Color Entry</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GCLUT</name>
                     <description>Green Color Entry</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RCLUT</name>
                     <description>Red Color Entry</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ACLUT</name>
                     <description>Alpha Color Entry</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
